
// Сумма чисел--------------------------------------------------------------------------------------------------
// const p1 = 8;
// const getSumNum = (p) => {
//     let s = 0;
//     for (i = 0; i <= p; i++){
//     s = s + i;
//     }
//     return s; 
// }
// console.log(getSumNum(p1));


// Произведение чисел--------------------------------------------------------------------------------------------------
// const p2 = 8;
// const getMultiplyNum = (p) => {
//     let s = 1;
//     for (i = 1; i <= p; i++){
//     s = s * i;
//     }
//     return s; 
// }
// console.log(getMultiplyNum(p2));



// Простое число--------------------------------------------------------------------------------------------------
// const p3 = 100;
// getEvenOdd = (p) => {
//         for(let i = 1; i <= p; i++){
//             if(i % 2 == 0){
//                 console.log('Четное число:' + ' ' , i);
//             }
//             else{
//                 console.log('Нечетное число:' + ' ' , i);
//             }
//         }
//     return;
// }
// getEvenOdd(p3)

// Чёт-нечёт2--------------------------------------------------------------------------------------------------
// const p3 = 100;
// getEvenOdd = (p) => {
//     let even = [];
//     let odd = [];
//         for(let i = 1; i <= p; i++){
//             if(i % 2 == 0){
//                 even.push(i);
//             }
//             else{
//                 odd.push(i)
//             }
//         }
//     return`Чётные : ${even.toString()}\nНечётные : ${odd.toString()}`
// }
// console.log(
//  getEvenOdd(p3));



// Простое число--------------------------------------------------------------------------------------------------
// const p4 = 88;
// isPrimeNum = (p) => {
//     let checkPrime = true;
//     for (let i = 2; i < p; i++){
//         if (p % i === 0){
//             checkPrime = false;
//             break;
//         }
//     }
//     if (checkPrime) {
//         return `${p} - Простое число`;
//     }
//     else {
//         return `${p} - Составное число`;
//     }
// }
// isPrimeNum(p4);
// не работает----------------------------------------------------------------------------------------------------------


// Таблица умножения числа-------------------------------------------------------------------------------------------------
// const p5 = 9;
// writeTableMulitiply = (p) => {
//     let res = 0;
//     for( i = 1; i <= 10; i++){
//         res = p * i, console.log(p + ' x ' + i + ' = ' + res)
//     }
   
// }
// writeTableMulitiply(p5);

//сумма цифр---------------------------------------------------------------------------------------------------------


// const p6 = 6789;
// getSumDigits = (p) => {
//     let res = 0;
//     let str = p.toString();
// for (let i of str) {
//     res += parseInt(i);
// }
// return res;
// }
// console.log(getSumDigits(p6));

//обратное число----------------------------------------------------------------------------------------------------

// const p7 = 789;
// getReverseNumber = (p) => {
//     let rev = '1' + '/' + p;
//     return rev;
// }
// console.log(getReverseNumber(p7));

//количество цифр---------------------------------------------------------------------------------------------------

// const p8 = 39545;
// getCountDidits =(p) => {
//     let str = p.toString();
//     const res = str.length;
//     return res;
// }
// console.log(getCountDidits(p8));



//проверка на палиндром-------------------------------------------------------------------------------------------------

// const p9 = 7897;
// checkPalindromeOrNot = (p) => {
//     let res = 'палиндром';
//     p = String(p);
//     for (i = 0; i <= (p.length / 2); i++) {
//            if (p[i] !== p[p.length - 1 - i])  {
//             res = 'не палиндром';
//             break
//            }
       
//         }
//         return res;
//     }
// console.log(checkPalindromeOrNot(p9));

//сумма квадратов-------------------------------------------------------------------------------------------------------------

// const p2 = 8;
// const getSumQuadroNum = (p) => {
//     let s = 0;
//     for (i = 1; i <= p; i++){
//     s = s + ( i ** 2 );
//     }
//     return s; 
// }
// console.log(getSumQuadroNum(p2));

